import os

from cons import PATH_PROJECT

PATH_DFS = os.path.join(PATH_PROJECT, 'invest/data/dfs')
PATH_PYS = os.path.join(PATH_PROJECT, 'invest/data/pys')

ROUNDS = {
    0.001: [
        '营业收入-同比增长',
        '营业收入-季度环比增长',
        '净利润-同比增长',
        '净利润-季度环比增长',
        '每股净资产',
        '净资产收益率',
        '资产-总资产同比',
        '负债-总负债同比',
        '资产负债率', '净现金流-同比增长',
        '经营性现金流-净现金流占比',
        '投资性现金流-净现金流占比',
        '融资性现金流-净现金流占比',
        '净利润同比',
        '营业总收入同比',
        '每股收益',
    ],
    1000000: [
        '营业收入-营业收入',
        '营业收入-去年同期',
        '净利润-净利润',
        '净利润-去年同期',
        '资产-货币资金',
        '资产-应收账款',
        '资产-存货',
        '资产-总资产',
        '负债-应付账款',
        '负债-预收账款',
        '负债-总负债',
        '股东权益合计',
        '净现金流-净现金流',
        '经营性现金流-现金流量净额',
        '投资性现金流-现金流量净额',
        '融资性现金流-现金流量净额',
        '净利润',
        '营业利润',
        '利润总额',
        '营业总收入',
        '营业总支出-营业支出',
        '营业总支出-销售费用',
        '营业总支出-管理费用',
        '营业总支出-财务费用',
        '营业总支出-营业总支出', ]
}
